
<details><summary>Show Plan</summary>

``` terraform
terraform
module.sdk_analysis.module.ecs_task.null_resource.docker_build: Refreshing state... [id=494194448135757223]
module.sdk_analysis.module.lambda.null_resource.docker_build: Refreshing state... [id=237655538103629768]
module.sdk_analysis.aws_s3_bucket.analyzed_bucket: Refreshing state... [id=modl-sdk-analyzed]
module.downloads[0].aws_iam_role.downloads_role: Refreshing state... [id=s3_downloads_role]
module.downloads[0].aws_s3_bucket.log_bucket: Refreshing state... [id=curibio-modl-server-access-logs]
module.downloads[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:725604423866:certificate/691b9483-8679-4d94-82e4-c53a2ff634fc]
module.downloads[0].aws_route53_zone.main: Refreshing state... [id=Z03799832ACKUNJ8IZDHB]
module.sdk_analysis.module.lambda.aws_ecr_repository.ecr: Refreshing state... [id=modl-sdk_upload]
module.sdk_analysis.module.ecs_task.aws_ecr_repository.ecr: Refreshing state... [id=modl-sdk_analysis]
module.sdk_analysis.module.ecs_task.aws_cloudwatch_log_group.sdk-analysis-logs: Refreshing state... [id=modl-sdk-analysis]
module.jupyter_notebook[0].aws_s3_bucket.jupyter: Refreshing state... [id=jupyter-sdk.curibio-modl.com]
module.sdk_analysis.aws_s3_bucket.upload_bucket: Refreshing state... [id=modl-sdk-upload]
module.sdk_analysis.module.lambda.null_resource.docker_tag: Refreshing state... [id=3977070376333150817]
module.sdk_analysis.module.lambda.null_resource.docker_push: Refreshing state... [id=2561484821548041148]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/modl-sdk-upload-lambda]
module.sdk_analysis.module.ecs_task.null_resource.docker_tag: Refreshing state... [id=134254638304935216]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=modl-sdk-upload-lambda]
module.sdk_analysis.module.ecs_task.null_resource.docker_push: Refreshing state... [id=1966001569761004287]
module.jupyter_notebook[0].aws_cloudfront_distribution.jupyter_sdk_distribution: Refreshing state... [id=E2E51DTG2P23PH]
module.downloads[0].aws_route53_record.sqsp_verify: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_862laeb5r7tfnxngc2mc_CNAME]
module.downloads[0].aws_route53_record.sqsp_www: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_www_CNAME]
module.downloads[0].aws_route53_record.cname_ssl_verification["*.curibio-modl.com"]: Refreshing state... [id=Z03799832ACKUNJ8IZDHB__57b523665a1e9e3baef95f3dc85315ae.curibio-modl.com._CNAME]
module.downloads[0].aws_route53_record.google_site_verification: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_TXT]
module.downloads[0].aws_route53_record.github_verification: Refreshing state... [id=Z03799832ACKUNJ8IZDHB__github-challenge-curibio.www.curibio.com_TXT]
module.downloads[0].aws_route53_record.mx_record: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_MX]
module.downloads[0].aws_route53_record.a_record: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_A]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=modl-sdk-upload-lambda]
module.jupyter_notebook[0].aws_route53_record.jupyter_cname: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_jupyter-sdk.curibio-modl.com_CNAME]
module.downloads[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2021-03-16 22:33:28 +0000 UTC]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::725604423866:policy/modl-sdk-upload-lambda-logs]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.logs[0]: Refreshing state... [id=modl-sdk-upload-lambda-logs]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::725604423866:policy/modl-sdk-upload-lambda-inline]
module.downloads[0].aws_s3_bucket.downloads: Refreshing state... [id=downloads.curibio-modl.com]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.additional_inline[0]: Refreshing state... [id=modl-sdk-upload-lambda]
module.downloads[0].aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E1CI0FY7D89ZVE]
module.downloads[0].aws_s3_bucket_policy.downloads_policy: Refreshing state... [id=downloads.curibio-modl.com]
module.downloads[0].aws_iam_role_policy.s3_downloads: Refreshing state... [id=s3_downloads_role:s3_downloads_policy]
module.downloads[0].aws_route53_record.cname: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_downloads.curibio-modl.com_CNAME]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.aurora_database.aws_db_parameter_group.parameter_group will be created
  + resource "aws_db_parameter_group" "parameter_group" {
      + arn         = (known after apply)
      + description = "modl-mantarray-db-parameter-group"
      + family      = "aurora-mysql5.7"
      + id          = (known after apply)
      + name        = "modl-mantarray-db-parameter-group"
      + name_prefix = (known after apply)
      + tags        = {
          + "Application" = "mantarray-db"
          + "Environment" = "modl"
        }
      + tags_all    = {
          + "Application" = "mantarray-db"
          + "Environment" = "modl"
        }
    }

  # module.aurora_database.aws_default_subnet.default_subnet_a will be created
  + resource "aws_default_subnet" "default_subnet_a" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = (known after apply)
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = (known after apply)
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = (known after apply)
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.aurora_database.aws_default_subnet.default_subnet_b will be created
  + resource "aws_default_subnet" "default_subnet_b" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = (known after apply)
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = (known after apply)
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = (known after apply)
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.aurora_database.aws_default_subnet.default_subnet_c will be created
  + resource "aws_default_subnet" "default_subnet_c" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = (known after apply)
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = (known after apply)
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = (known after apply)
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.aurora_database.aws_default_vpc.default_vpc will be created
  + resource "aws_default_vpc" "default_vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = (known after apply)
      + cidr_block                       = (known after apply)
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = (known after apply)
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags_all                         = (known after apply)
    }

  # module.aurora_database.aws_rds_cluster_parameter_group.cluster_parameter_group will be created
  + resource "aws_rds_cluster_parameter_group" "cluster_parameter_group" {
      + arn         = (known after apply)
      + description = "modl-mantarray-db-cluster-parameter-group"
      + family      = "aurora-mysql5.7"
      + id          = (known after apply)
      + name        = "modl-mantarray-db-cluster-parameter-group"
      + name_prefix = (known after apply)
      + tags        = {
          + "Application" = "mantarray-db"
          + "Environment" = "modl"
        }
      + tags_all    = {
          + "Application" = "mantarray-db"
          + "Environment" = "modl"
        }
    }

  # module.aurora_database.random_password.master_password will be created
  + resource "random_password" "master_password" {
      + id          = (known after apply)
      + length      = 10
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.sdk_analysis.aws_s3_bucket_notification.bucket_notification will be created
  + resource "aws_s3_bucket_notification" "bucket_notification" {
      + bucket = "modl-sdk-upload"
      + id     = (known after apply)

      + queue {
          + events    = [
              + "s3:ObjectCreated:*",
            ]
          + id        = (known after apply)
          + queue_arn = (known after apply)
        }
    }

  # module.sdk_analysis.aws_sqs_queue.sdk_queue_deadletter will be created
  + resource "aws_sqs_queue" "sdk_queue_deadletter" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "modl-sdk-queue-deadletter"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.sdk_analysis.aws_sqs_queue.sdk_upload_queue will be created
  + resource "aws_sqs_queue" "sdk_upload_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "modl-sdk-upload-queue"
      + name_prefix                       = (known after apply)
      + policy                            = jsonencode(
            {
              + Id        = "sqspolicy"
              + Statement = [
                  + {
                      + Action    = "sqs:SendMessage"
                      + Condition = {
                          + ArnEquals = {
                              + aws:SourceArn = "arn:aws:s3:::modl-sdk-upload"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:sqs:*:*:modl-sdk-upload-queue"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + receive_wait_time_seconds         = 0
      + redrive_policy                    = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.aurora_database.module.db.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "For Aurora cluster modl-mantarray-db"
      + id          = (known after apply)
      + name        = "modl-mantarray-db"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Application" = "mantarray-db"
          + "Environment" = "modl"
          + "Name"        = "aurora-modl-mantarray-db"
        }
      + tags_all    = {
          + "Application" = "mantarray-db"
          + "Environment" = "modl"
          + "Name"        = "aurora-modl-mantarray-db"
        }
    }

  # module.aurora_database.module.db.aws_rds_cluster.this[0] will be created
  + resource "aws_rds_cluster" "this" {
      + allow_major_version_upgrade         = false
      + apply_immediately                   = true
      + arn                                 = (known after apply)
      + availability_zones                  = (known after apply)
      + backtrack_window                    = 0
      + backup_retention_period             = 7
      + cluster_identifier                  = "modl-mantarray-db"
      + cluster_identifier_prefix           = (known after apply)
      + cluster_members                     = (known after apply)
      + cluster_resource_id                 = (known after apply)
      + copy_tags_to_snapshot               = false
      + database_name                       = (known after apply)
      + db_cluster_parameter_group_name     = (known after apply)
      + db_subnet_group_name                = "modl-mantarray-db"
      + deletion_protection                 = false
      + enable_http_endpoint                = false
      + endpoint                            = (known after apply)
      + engine                              = "aurora-mysql"
      + engine_mode                         = "provisioned"
      + engine_version                      = "5.7.mysql_aurora.2.09.2"
      + engine_version_actual               = (known after apply)
      + final_snapshot_identifier           = (known after apply)
      + hosted_zone_id                      = (known after apply)
      + iam_database_authentication_enabled = false
      + iam_roles                           = (known after apply)
      + id                                  = (known after apply)
      + kms_key_id                          = (known after apply)
      + master_password                     = (sensitive value)
      + master_username                     = "admin"
      + port                                = 3306
      + preferred_backup_window             = "02:00-03:00"
      + preferred_maintenance_window        = "sun:05:00-sun:06:00"
      + reader_endpoint                     = (known after apply)
      + skip_final_snapshot                 = false
      + storage_encrypted                   = true
      + tags                                = {
          + "Application" = "mantarray-db"
          + "Environment" = "modl"
        }
      + tags_all                            = {
          + "Application" = "mantarray-db"
          + "Environment" = "modl"
        }
      + vpc_security_group_ids              = (known after apply)
    }

  # module.aurora_database.module.db.aws_rds_cluster_instance.this[0] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately               = true
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = (known after apply)
      + ca_cert_identifier              = "rds-ca-2019"
      + cluster_identifier              = (known after apply)
      + copy_tags_to_snapshot           = false
      + db_parameter_group_name         = (known after apply)
      + db_subnet_group_name            = "modl-mantarray-db"
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "aurora-mysql"
      + engine_version                  = "5.7.mysql_aurora.2.09.2"
      + engine_version_actual           = (known after apply)
      + id                              = (known after apply)
      + identifier                      = "modl-mantarray-db-1"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.t3.small"
      + kms_key_id                      = (known after apply)
      + monitoring_interval             = 0
      + monitoring_role_arn             = (known after apply)
      + performance_insights_enabled    = false
      + performance_insights_kms_key_id = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = "sun:05:00-sun:06:00"
      + promotion_tier                  = 1
      + publicly_accessible             = false
      + storage_encrypted               = (known after apply)
      + tags                            = {
          + "Application" = "mantarray-db"
          + "Environment" = "modl"
        }
      + tags_all                        = {
          + "Application" = "mantarray-db"
          + "Environment" = "modl"
        }
      + writer                          = (known after apply)
    }

  # module.aurora_database.module.db.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "modl-mantarray-db-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Application" = "mantarray-db"
          + "Environment" = "modl"
          + "Name"        = "aurora-modl-mantarray-db"
        }
      + tags_all               = {
          + "Application" = "mantarray-db"
          + "Environment" = "modl"
          + "Name"        = "aurora-modl-mantarray-db"
        }
      + vpc_id                 = (known after apply)
    }

  # module.aurora_database.module.db.random_id.snapshot_identifier[0] will be created
  + resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id" = "modl-mantarray-db"
        }
    }

  # module.sdk_analysis.module.ecs_task.data.aws_ecs_task_definition.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ecs_task_definition" "main"  {
      + family          = (known after apply)
      + id              = (known after apply)
      + network_mode    = (known after apply)
      + revision        = (known after apply)
      + status          = (known after apply)
      + task_definition = "modl-sdk_analysis-ecs-task-definition"
      + task_role_arn   = (known after apply)
    }

  # module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_a will be created
  + resource "aws_default_subnet" "default_subnet_a" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = (known after apply)
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = (known after apply)
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = (known after apply)
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_b will be created
  + resource "aws_default_subnet" "default_subnet_b" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = (known after apply)
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = (known after apply)
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = (known after apply)
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_c will be created
  + resource "aws_default_subnet" "default_subnet_c" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = (known after apply)
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = (known after apply)
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = (known after apply)
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.sdk_analysis.module.ecs_task.aws_default_vpc.default_vpc will be created
  + resource "aws_default_vpc" "default_vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = (known after apply)
      + cidr_block                       = (known after apply)
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = (known after apply)
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags_all                         = (known after apply)
    }

  # module.sdk_analysis.module.ecs_task.aws_ecs_cluster.aws-ecs-cluster will be created
  + resource "aws_ecs_cluster" "aws-ecs-cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "modl-sdk_analysis-cluster"
      + tags     = {
          + "Name" = "modl-sdk_analysis-ecs"
        }
      + tags_all = {
          + "Name" = "modl-sdk_analysis-ecs"
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # module.sdk_analysis.module.ecs_task.aws_ecs_service.aws-ecs-service will be created
  + resource "aws_ecs_service" "aws-ecs-service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "modl-sdk_analysis-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = true
          + subnets          = (known after apply)
        }
    }

  # module.sdk_analysis.module.ecs_task.aws_ecs_task_definition.aws-ecs-task will be created
  + resource "aws_ecs_task_definition" "aws-ecs-task" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "modl-sdk_analysis-ecs-task-definition"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # module.sdk_analysis.module.ecs_task.aws_iam_role.ecsTaskExecutionRole will be created
  + resource "aws_iam_role" "ecsTaskExecutionRole" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "modl-sdk_analysis-execution-task-role"
      + path                  = "/"
      + tags                  = {
          + "Name" = "modl-sdk_analysis-iam-role"
        }
      + tags_all              = {
          + "Name" = "modl-sdk_analysis-iam-role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.sdk_analysis.module.ecs_task.aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "modl-sdk_analysis-ecs_task_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "modl-sdk_analysis-ecs_inline_policy"
          + policy = (known after apply)
        }
    }

  # module.sdk_analysis.module.ecs_task.aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecsTaskExecutionRole_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "modl-sdk_analysis-execution-task-role"
    }

Plan: 25 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...

```

</details>

Pusher: @luciipak